# Data Wrangling I

In [1]:
import pandas as pd
import numpy as np

In [8]:
data = {'coluna1': [1, 2, 3, 3, 4, 4],
        'coluna2': ['a', 'b', 'c', 'c', 'd', 'e']}
df = pd.DataFrame(data)
df

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
3        3       c
4        4       d
5        4       e

In [9]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [10]:
df.drop_duplicates()

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
4        4       d
5        4       e

In [11]:
df2 = df.sort_values('coluna1')
df2 = df2.drop_duplicates(keep='last')
df2

   coluna1 coluna2
0        1       a
1        2       b
3        3       c
4        4       d
5        4       e

In [13]:
df.drop_duplicates(subset=['coluna1'])

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
4        4       d

# Datas

In [15]:
df = pd.DataFrame({'data': ['2022-01-01', '2022-01-02', '2022-01-03']})
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes
None

In [16]:
df['data'] = pd.to_datetime(df['data'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes

In [17]:
df['ano'] = df['data'].dt.year
df['mes'] = df['data'].dt.month
df['dia'] = df['data'].dt.day
df['dia_semana'] = df['data'].dt.day_name()
df

        data   ano  mes  dia dia_semana
0 2022-01-01  2022    1    1   Saturday
1 2022-01-02  2022    1    2     Sunday
2 2022-01-03  2022    1    3     Monday

In [18]:
df['prox_data'] = df['data'] + pd.DateOffset(days=7)
df

        data   ano  mes  dia dia_semana  prox_data
0 2022-01-01  2022    1    1   Saturday 2022-01-08
1 2022-01-02  2022    1    2     Sunday 2022-01-09
2 2022-01-03  2022    1    3     Monday 2022-01-10

In [19]:
df2= pd.DataFrame({'data': ['2022/01/01', '2022/01/02', '2022/01/03']})
df2['data'] = pd.to_datetime(df2['data'],format="%Y/%m/%d")
print(df2)

        data
0 2022-01-01
1 2022-01-02
2 2022-01-03

In [ ]:
df2['data_str'] = df2['data'].dt.strftime('%d/%m/%Y')
df2

# Concat, merge, ordenacao e join
revisao aula 10

# Amostra

In [25]:
# Criar um DataFrame de exemplo
data = {'coluna1': [1, 2, 3, 4, 5],
        'coluna2': ['a', 'b', 'c', 'd', 'e']}
df = pd.DataFrame(data)
df

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e

In [24]:
df.sample(n=3,random_state = 42)

   coluna1 coluna2
1        2       b
4        5       e
2        3       c